'use client';

import {HeadLine1} from '@/component';
import styled from 'styled-components';

export default function PrivacyContent() {
  return (
    <Container>
      <HeadLine1>개인정보 수집 및 이용동의</HeadLine1>
      <PrivacyPolicy>
        <p>
            제 1조 (목적)
            이 약관은 (주)위글 플러스(이하 “회사”)가 제공하는 교육, 과제, 채용 서비스(이하 "서비스")의 이용과 관련하여 회사와 이용자의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.
        </p>
        <p>
            제 2조 (정의)
            "서비스"란 회사가 제공하는 교육, 과제, 채용 관련 모든 콘텐츠 및 기능을 의미합니다.
            "이용자"란 회사의 서비스에 접속하여 이 약관에 따라 회사가 제공하는 서비스를 받는 회원 및 비회원을 의미합니다.
            "회원"이란 회사에 개인정보를 제공하여 회원등록을 한 자로서, 회사의 정보를 지속적으로 제공받으며, 회사가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 의미합니다.
            "비회원"이란 회원으로 가입하지 않고 회사가 제공하는 서비스를 이용하는 자를 의미합니다.
        </p>
        <p>
            제 3조 (약관의 게시와 개정)
            회사는 이 약관의 내용을 이용자가 쉽게 알 수 있도록 서비스 초기 화면에 게시합니다.
            회사는 관련 법령에 따라 약관을 개정할 수 있습니다. 약관이 개정되는 경우, 회사는 개정된 약관을 적용하기 7일 전에 공지합니다.
            이용자는 개정된 약관에 대해 거부할 권리가 있으며, 개정된 약관의 효력 발생일로부터 7일 이내에 거부 의사를 표시하지 않으면 개정된 약관에 동의한 것으로 간주됩니다.
        </p>
        <p>
            제 4조 (서비스의 제공 및 변경)
            회사는 이용자에게 다음과 같은 서비스를 제공합니다.
            교육 콘텐츠 제공 서비스 과제 지원 및 관리 서비스 채용 정보 제공 서비스 회사는 서비스의 내용 및 제공 방식을 변경할 수 있으며, 이 경우 변경된 내용 및 일자를 명시하여 사전에 공지합니다.
        </p>
        <p>
            제 5조 (서비스의 중단)
            회사는 다음 각 호에 해당하는 경우 서비스의 제공을 일시적으로 중단할 수 있습니다.
            시스템 점검, 보수 또는 공사를 위해 필요한 경우 정전, 화재, 천재지변 등 불가항력적인 사유가 발생한 경우 회사는 서비스 중단의 사유 및 기간을 사전에 공지합니다.
            다만, 긴급한 사유가 있는 경우 사후에 공지할 수 있습니다.
        </p>
        <p>
            제 6조 (회원가입)
            이용자는 회사가 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의함으로써 회원가입을 신청합니다.
            회사는 회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다:
            등록 내용에 허위, 기재누락, 오기가 있는 경우 기타 회원으로 등록하는 것이 회사의 기술상 현저히 지장이 있다고 판단되는 경우
        </p>
        <p>
            제 7조 (회원탈퇴 및 자격 상실)
            회원은 언제든지 회사에 회원 탈퇴를 요청할 수 있으며, 회사는 즉시 회원 탈퇴를 처리합니다.
            회원이 다음 각 호의 사유에 해당하는 경우, 회사는 회원 자격을 제한 및 정지시킬 수 있습니다:
            가입 신청 시에 허위 내용을 등록한 경우 다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를 위협하는 경우 서비스를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
        </p>
        <p>
            제 8조 (회원의 의무)
            회원은 다음 행위를 하여서는 안 됩니다:
            신청 또는 변경 시 허위 내용의 등록 타인의 정보 도용 회사가 게시한 정보의 변경 회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시 회사 기타 제3자의 저작권 등 지적재산권에 대한 침해 회사 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 서비스에 공개 또는 게시하는 행위
        </p>
        <p>
            제 9조 (회사의 의무)
            회사는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며, 지속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다합니다.
            회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를 즉시 처리하여야 하며, 즉시 처리가 곤란한 경우에는 그 사유와 처리일정을 서비스 화면 또는 기타 방법을 통해 동 회원에게 통지하여야 한다.
        </p>
        <p>
                    제 10조 (개인정보보호) 회사는 이용자의 개인정보 수집 시 서비스 제공을 위해 필요한 범위에서 최소한의 개인정보를 수집합니다. 회사는 회원가입 시 제공한 정보 외에 추가적인
                    개인정보를
                    수집하고자 하는
                    경우, 반드시 해당 이용자의 동의를 받습니다. 회사는 이용자의 개인정보를 수집 및 이용하는 때에는 당해 이용자에게 그 목적을 고지하고 동의를 받습니다. 회사는 수집된 개인정보를
                    목적 외의
                    용도로
                    사용하거나 이용자의 동의 없이 제3자에게 제공하지 않습니다. 다만, 관련 법령에 의해 필요한 경우에는 예외로 합니다.
        </p>
        <p>
                    제 11조 (저작권의 귀속 및 이용제한) 회사가 작성한 저작물에 대한 저작권 및 기타 지적재산권은 회사에 귀속합니다. 이용자는 서비스를 이용함으로써 얻은 정보를 회사의 사전 승낙
                    없이
                    복제, 송신,
                    출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안 됩니다.
        </p>
        <p>
                    제 12조 (약관의 해석) 이 약관에 명시되지 않은 사항에 대해서는 관계 법령 및 상관례에 따릅니다.
        </p>
        <p>
                    제 13조 (회원의 개인정보보호) "회사"는 "회원"의 개인정보보호를 위하여 노력해야 한다. "회원"의 개인정보보호에 관해서는 정보통신망이용촉진 및 정보보호 등에 관한 법률,
                    개인정보보호법 등 관련
                    법령과 "회사"가 "사이트"에 게시하는 개인정보취급방침에 따릅니다.

        </p>
        <p>제 14조 (이용요금 오류의 조정) "회사"는 이용요금과 관련하여 오류가 있는 경우에 "회원"의 요청, 또는 "회사"의
                    사전 통지에
                    의하여 다음에 해당하는 조치를 취합니다. 요금을 반환 받아야 할 "회원"이 요금체납이 있는 경우에는 반환해야 할 요금에서 이를 우선 공제하고 반환합니다. "회사"는 과소청구액에
                    대해서는
                    익월에 합산
                    청구합니다.
        </p>
        <p>제 15조 (신용정보의 제공 활용 동의) "회사"가 회원가입과 관련하여 취득한 "회원"의 개인신용정보를 타인에게 제공하거나 활용하고자 할 때에는 신용정보의 이용 및 보호에
                    관한 법률
                    제23조의 규정에 따라 사전에 그 사유 및 해당기관 또는 업체명 등을 밝히고 해당 "회원"의 동의를 얻어야 합니다. 본 서비스와 관련하여 "회사"가 "회원"으로부터 신용정보의 이용
                    및
                    보호에 관한
                    법률에 따라 신용정보의 제3자 제공에 대한 동의를 얻은 경우, "회사"는 신용정보 사업자 또는 신용정보 집중기관에 해당 신용정보를 제공하여 "회원"의 신용을 판단하기 위한 자료로
                    활용하거나,
                    공공기관에서 정책자료로 활용되도록 정보를 제공할 수 있습니다.
        </p>
        <p>제 16조 (연동회원) "회원"은 연동된 하나의 계정(ID 및 비밀번호)를 통해 이 약관 제4조 제1호에서 명시한 "사이트"
                    및 관련 서비스를 이용할 수 있습니다. "회사"는 하나의 계정을 통한 통합서비스 제공을 위하여 각 "사이트"간 서비스 내용을 연동하는 등 "사이트" 또는 서비스를 개선, 변경할 수
                    있습니다.
                    회원의 최초 서비스
                    이용신청 이후 회사의 사이트가 추가되는 경우 별도 약관으로 명시하지 않는 한 이 약관이 적용되며, 회사는 신규 사이트 또는 서비스 개시에 대한 정보를 "사이트"에 공지하거나
                    회원에게
                    전자우편으로 공지할
                    수 있습니다.
        </p>
        <p>
                    제 17조 (분쟁해결) 회사는 이용자가 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상처리하기 위하여 고객센터를 설치 및 운영합니다. 회사는 이용자로부터 제출되는 불만사항
                    및
                    의견을 신속하게
                    처리합니다. 다만, 신속한 처리가 곤란한 경우에는 그 사유와 처리 일정을 즉시 통보합니다. 이 약관에 관한 분쟁은 대한민국 법률을 준거법으로 하여 해결합니다.
        </p>
        <p>
                    제 18조 (기타) 회사는 필요에 따라 개별 서비스에 대한 개별 약관 또는 운영원칙(이하 "개별 약관 등")을 정할 수 있으며, 해당 내용은 본 약관과 동일한 절차에 따라
                    공지됩니다. 본
                    약관과 개별
                    약관 등의 내용이 상충하는 경우, 개별 약관 등의 내용을 우선 적용합니다.
        </p>
        <p> 이 약관은 2024년 8월 19일부터 시행합니다. </p>
      </PrivacyPolicy>
    </Container>
  );
}

const Container = styled.main`
    max-width: 768px;
    margin: 0 auto;
`;

const PrivacyPolicy = styled.div`
    display: flex;
    flex-direction: column;
    gap: 12px;
    margin-top: 24px;
    line-height: 1.8
`;
